Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Download and install the https://marketplace.visualstudio.com/items?itemName=redhat.vscode-extension-dmn-editor[Red Hat DMN Editor VSCode Extension] to edit and model process definitions from VSCode IDE.
ja_jp: VSCode IDE からプロセス定義を編集およびモデル化するために、 https://marketplace.visualstudio.com/items?itemName=redhat.vscode-extension-bpmn-editor[Red Hat BPMN エディタVSCodeエクステンション] をダウンロードしてインストールします。

source: Download full cheatsheet as PDF.
ja_jp: チートシート全文をPDFでダウンロード

source: Download the Cheat Sheet
ja_jp: チートシートをダウンロード

source: Download the appropriate archive from <https://github.com/graalvm/mandrel/releases> or <https://github.com/graalvm/graalvm-ce-builds/releases>, and unpack it like you would any other JDK.
ja_jp: <https://github.com/graalvm/mandrel/releases> または <https://github.com/graalvm/graalvm-ce-builds/releases> から適切なアーカイブをダウンロードし、他の JDK と同じように展開します。

source: Download the {quickstarts-archive-url}[archive]
ja_jp: {quickstarts-archive-url}[アーカイブ]をダウンロードする。

source: Download the {quickstarts-archive-url}[archive].
ja_jp: {quickstarts-archive-url}[アーカイブ] をダウンロードします。

source: Downloading Maven artifact dependencies for offline development and testing
ja_jp: オフライン開発とテスト向けの Maven アーティファクトの依存関係のダウンロード

source: Downloading dependencies for offline development and testing
ja_jp: オフラインでの開発やテストのための依存ファイルのダウンロード

source: Downloads
ja_jp: ダウンロード

source: Driver
ja_jp: ドライバー

source: Drools allows defining rules with 2 different programming styles: one more traditional based on the concepts of a KieBase acting as a repository of business rules and a KieSession storing and evaluating the runtime data against them, and the other using a Rule Unit as a single abstraction that encapsulates the definitions of both a set of rules and the facts against which those rules will be matched.
ja_jp: Drools では、2 つの異なるプログラミングスタイルでルールを定義できます。1 つは、ビジネスルールのリポジトリーとして機能する KieBase と、それらに対して実行時データを保存および評価する KieSession の概念に基づいた、より伝統的なスタイルです。もう 1 つは、ルールセットとそれらのルールが照合されるファクトの両方の定義をカプセル化する単一の抽象化としてルールユニットを使用するスタイルです。

source: Drools is the most used rule engine implementation in the Java ecosystem.
ja_jp: Drools は、Java エコシステムで最も使用されているルール エンジン実装です。

source: Drop and create the database at startup (use `update` to only update the schema).
ja_jp: 起動時にデータベースを削除して作成します (スキーマのみを更新するには `update` を使用します)。

source: Drop the goals, they will be handled automatically and we don't want to run them twice.
ja_jp: ゴールは削除してください。これらは自動的に処理されるため、二重に実行する必要はありません。

source: Due to a limitation in Hibernate ORM itself, `@PreDestroy` methods on `@Dependent`-scoped interceptors will never get called.
ja_jp: Hibernate ORM 自体の制限により、 `@Dependent` スコープのインターセプターの `@PreDestroy` メソッドは決して呼び出されません。

source: Due to some infra issues, the Kogito extensions are not part of the 2.7.0.Final. If you are using Kogito, stay on 2.6.3.Final until we release Quarkus 2.7.1.Final, which will bring back the Kogito extensions.
ja_jp: インフラの問題により、Kogitoのエクステンションは2.7.0.Finalには含まれていません。Kogitoを使用している場合は、Quarkus 2.7.1.Finalがリリースされるまで2.6.3.Finalを使用してください。

source: Due to the above described behavior, it is recommended to avoid using `@PreDestroy` on `@RequestScoped` beans when working with Context Propagation in CDI.
ja_jp: 上記で説明した動作のため、CDI で Context Propagation を使用する際には `@PreDestroy` を `@RequestScoped` Beanで使用しないことをお勧めします。

source: Due to the license change made by Elastic for the Elasticsearch High Level REST Client, we are keeping in Quarkus the last Open Source version of this particular client, namely 7.10, and it won't be upgraded to newer versions.
ja_jp: Elastic社がElasticsearch 高レベルRESTクライアントのライセンスを変更したため、Quarkusではこの特定のクライアントの最後のオープンソースバージョンである7.10を維持しており、新しいバージョンへのアップグレードはありません。

source: Due to the restrictions imposed by GraalVM, extra care needs to be taken when implementing or extending generic types provided by the client if the application is intended to work in native mode. Essentially every implementation or extension of generic classes such as `Watcher`, `ResourceHandler` or `CustomResource` needs to specify their associated Kubernetes model class (or, in the case of `CustomResource`, regular Java types) at class definition time. To better understand this, suppose we want to watch for changes to Kubernetes `Pod` resources. There are a couple ways to write such a `Watcher` that are guaranteed to work in native:
ja_jp: GraalVMによって課せられた制限のため、アプリケーションがネイティブモードで動作することを意図している場合、 クライアントによって提供されるジェネリック型を実装または拡張する際には特別な注意が必要です。基本的に、 `Watcher`、 ` ResourceHandler`、 `CustomResource`などのジェネリッククラスのすべての実装または拡張は、クラス定義時に関連するKubernetesモデルクラス（または、 ` CustomResource` の場合は通常のJavaタイプ）を指定する必要があります。 よく理解するために、例えばKubernetesの `Pod`リソースへの変更を監視するとします。 ネイティブでの動作が保証されているこのような `Watcher` を作成するには、いくつかの方法があります。

source: Due to the sensitive nature of security bugs, the disclosure process is more constrained than a regular bug. We appreciate you following these industry accepted guidelines, which gives time for a proper fix and limit the time window of attack.
ja_jp: セキュリティーバグは機密性が高いため、通常のバグよりも開示プロセスに制約があります。我々は、適切な修正のための時間を与え、攻撃の時間枠を制限する、業界で認められたこれらのガイドラインに従っていただけることに感謝します。

source: Due to the underlying library, graphql-java, `Uni` is creating a `CompletionStage` under the hood.
ja_jp: graphql-javaというライブラリを使用しているため、 `Uni` はボンネット内で `CompletionStage` を作成しています。

source: Due to the usage of enhancement, using the `clone()` method on entities is currently not supported as it will also clone some enhancement-specific fields that are specific to the entity.
ja_jp: Enhancement を使用しているため、エンティティで `clone()` メソッドを使用することは現在サポートされていません。これは、エンティティにEnhancement 固有のフィールドもクローンされるためです。

source: Due to the way we schedule our releases, Quarkus 2.6.0.Final doesn't include https://quarkus.io/blog/quarkus-2-5-4-final-released/[the fixes from Quarkus 2.5.4.Final]. We will release Quarkus 2.6.1.Final on Friday with all these fixes and more.
ja_jp: リリーススケジュールの都合上、Quarkus 2.6.0.Finalには link:https://quarkus.io/blog/quarkus-2-5-4-final-released/[Quarkus 2.5.4.Finalの修正]が含まれていません。これらの修正を含むQuarkus 2.6.1.Finalを金曜日にリリースする予定です。

source: Dumb getters and setters: since Java lacks support for properties in the language, we have to create fields, then generate getters and setters for those fields, even if they don't actually do anything more than read/write the fields.
ja_jp: ダサいゲッターとセッター：Javaは言語でプロパティをサポートしていないので、フィールドに対して読み書きを行わなかったとしてもフィールドを作成し、そのフィールドのためにゲッターとセッターを生成しなければなりません。

source: Dump Quarkus application dependencies
ja_jp: Quarkus アプリケーションの依存関係をダンプする

source: Dump current build configuration when the recorded configuration isn't found
ja_jp: 記録された設定が見つからない場合、現在のビルド時設定をダンプする

source: Dumping build time configuration options read during the build
ja_jp: ビルド中に読み込まれたビルド時設定オプションのダンプ

source: Duplicated context, context locals, asynchronous processing and propagation
ja_jp: コンテキストの重複、コンテキストローカル、非同期処理と伝播

source: Duplicated contexts and mapped diagnostic context (MDC)
ja_jp: 複製コンテキストとマッピングされた診断コンテキスト（MDC）

source: Duplicating ID logic: most entities need an ID, most people don't care how it is set, because it is not really relevant to your model.
ja_jp: IDロジックの重複:ほとんどのエンティティにはIDが必要ですが、モデルとはあまり関係がないため、ほとんどの人はIDの設定方法を気にしません。

source: Duplicating ID logic: most entities need an ID, most people don't care how it's set, because it's not really relevant to your model.
ja_jp: IDロジックの重複:ほとんどのエンティティにはIDが必要ですが、モデルとはあまり関係がないため、ほとんどの人はIDの設定方法を気にしません。

source: Duration
ja_jp: 説明

source: Duration of HTTP server requests
ja_jp: HTTP サーバーリクエストの期間

source: Duration of JVM garbage collection actions
ja_jp: JVM のガベージコレクションアクションの期間

source: Duration of waiting for a connection to a broker to be established.If the duration passes without a response from a broker, the connection attempt is dropped.
ja_jp: ブローカーからの応答がないまま期間が経過すると、接続の試みは中止されます。

source: During *tests only*, the URL is an optional property, and if it's not specified, Quarkus will assume that the target of the client is the application that is being tested (typically, `http://localhost:8081/graphql`). This is useful if your application contains a GraphQL server-side API as well as a GraphQL client that is used for testing the API.
ja_jp: *テストのみ* の場合、URL はオプションのプロパティであり、指定されていない場合、Quarkus はクライアントのターゲットがテストされているアプリケーションであると推定します (通常、 `http://localhost:8081/graphql`) 。これは、アプリケーションに GraphQL サーバー側 API と、API のテストに使用される GraphQL クライアントが含まれている場合に役立ちます。

source: During a lesson, represented by the `Lesson` class, a teacher teaches a subject to a group of students, for example, `Math by A.Turing for 9th grade` or `Chemistry by M.Curie for 10th grade`. If a subject is taught multiple times per week by the same teacher to the same student group, there are multiple `Lesson` instances that are only distinguishable by `id`. For example, the 9th grade has six math lessons a week.
ja_jp: `Lesson` クラスで表されるレッスンでは、 `Math by A.Turing for 9th grade` または `Chemistry by M.Curie for 10th grade` のように、教師は生徒グループにいずれかの教科を教えます。同じ教師が週に複数回、その教科を同じ生徒グループに教える場合、 `id` のみ異なる複数の `Lesson` インスタンスがあります。たとえば、9 年生には週に 6 回の数学の授業があります。

source: During a training phase, it records application behavior and gathers information such as loaded and linked classes, and in more recent versions also starts recording some JIT output - increasing scope and optimization potentials in each JVM version.
ja_jp: トレーニングフェーズ中に、アプリケーションの動作を記録し、ロードされたクラスやリンクされたクラスなどの情報を収集します。より新しいバージョンでは、JIT 出力の一部も記録し始め、各 JVM バージョンでスコープと最適化の可能性を拡大しています。

source: During an application build and package assembly process, Quarkus captures certain details about the produced distribution and then allows an SBOM generator to consume and record that information in an SBOM format.
ja_jp: アプリケーションビルドおよびパッケージアセンブリのプロセス中に、Quarkus は生成されたディストリビューションに関する特定の詳細をキャプチャーし、SBOM ジェネレーターがその情報を SBOM 形式で使用および記録できるようにします。

source: During application development, users can use workload projection to connect their application to a development database, or other locally-run services, without changing the actual application code or configuration.
ja_jp: アプリケーションの開発中、ユーザーは Workload Projection を使用して、実際のアプリケーションコードや設定を変更することなく、開発用データベースやその他のローカルで実行されるサービスにアプリケーションを接続することができます。

source: During native executable build time GraalVM analyses the application's call tree and generates a code-set that includes all the code it needs. Having a modular codebase is key to avoiding problems with unused or optional parts of your application, while at the same time reducing both native executable build times and size. In this section you will learn about the details behind the benefits of modularity for native applications.
ja_jp: ネイティブ実行可能ファイルのビルド時に、GraalVM はアプリケーションのコールツリーを分析し、必要なすべてのコードを含むコードセットを生成します。モジュラーコードベースを使用することは、アプリケーションの未使用部分またはオプション部分の問題を回避すると同時に、ネイティブ実行可能ファイルのビルド時間とサイズの両方を削減するための鍵となります。このセクションでは、ネイティブアプリケーションのモジュール化の利点の背後にある詳細について学習します。

source: During normal operation, a Kafka consumer preserves the order of records inside each partition assigned to it. SmallRye Reactive Messaging keeps this order for processing, unless `@Blocking(ordered = false)` is used (see <<blocking-processing>>).
ja_jp: 通常の操作中、Kafka コンシューマーは、割り当てられた各パーティション内のレコードの順序を保持します。 SmallRye Reactive Messaging は、 `@Blocking(ordered = false)` が使用されていない限り、この順序を処理のために保持します (<<blocking-processing>> を参照)。

source: During normal operation, a Kafka consumer preserves the order of records inside each partition assigned to it. Smallrye Reactive Messaging keeps this order for processing, unless `@Blocking(ordered = false)` is used (see <<blocking-processing>>).
ja_jp: 通常の操作中、Kafka コンシューマーは、割り当てられた各パーティション内のレコードの順序を保持します。Smallrye Reactive Messaging は、 `@Blocking(ordered = false)` が使用されていない限り、この順序を処理のために保持します (<<blocking-processing>>を参照)。

source: During project compilation, Kogito will read the file and generate the classes needed for the evaluation, together with a couple of REST endpoints.
ja_jp: プロジェクトのコンパイル時に、Kogitoはファイルを読み込んで、評価に必要なクラスと、いくつかのRESTエンドポイントを生成します。

source: During shutdown, the service is automatically deregistered.
ja_jp: シャットダウン時、サービスは自動的に登録解除されます。

source: During solving, OptaPlanner changes the `timeslot` and `room` fields of the `Lesson` class, to assign each lesson to a time slot and a room. Because OptaPlanner changes these fields, `Lesson` is a _planning entity_:
ja_jp: 解決中に、OptaPlanner は `Lesson` クラスの `timeslot` フィールドと `room` フィールドを変更し、各レッスンをタイムスロットと教室に割り当てます。OptaPlanner はこれらのフィールドを変更するため、 `Lesson` は _プランニングエンティティー_ です。

source: During testing Quarkus creates a separate broker instance to run the tests against it.
ja_jp: Quarkus はテスト中、別のブローカーインスタンスを作成し、これに対してテストを実行します。

source: During the TLS handshake, the server presents its certificate, which the client then validates. This prevents man-in-the-middle attacks and secures data transmission.
ja_jp: TLS ハンドシェイク中に、サーバーは証明書を提示し、クライアントはそれを検証します。 これにより、中間者攻撃を防ぎ、データ転送をセキュアに行うことができます。

source: During the application build, Quarkus rewrites calls to `Log` methods into JBoss Logging calls on the generated logger field.
ja_jp: アプリケーションのビルド中に、Quarkus は `Log` メソッドへの呼び出しを、生成されたロガーフィールド上の JBoss Logging 呼び出しに書き換えます。

source: During the build process, Quarkus proceeds to record the available configuration in the final binary, to ensure it can start successfully in runtime, without missing required configuration. The following sources are excluded from recording:
ja_jp: ビルドプロセス中に、 Quarkus は最終的なバイナリに必要な設定が不足せずに実行時に正常に起動できるように、利用可能な設定を記録します。以下のソースは記録から除外されます。

source: During the build process, Quarkus will create a class file containing the modified bytecode and will use it instead of the class coming from the GitHub API jar. Thus the bridge methods we wanted to remove will never be visible to ByteBuddy.
ja_jp: ビルドプロセスで、Quarkusは修正されたバイトコードを含むクラスファイルを作成し、GitHub API jarから来るクラスの代わりにそれを使用します。そのため、削除したいブリッジメソッドがByteBuddyから見えることはありません。

source: During the build you may find the `Caused by: javax.net.ssl.SSLHandshakeException: sun.security.validator.ValidatorException: PKIX path building failed` exception due to self-signed certificate. To solve this, just add the following line to your `application.properties`:
ja_jp: ビルド中に、自己署名証明書が原因で `Caused by: javax.net.ssl.SSLHandshakeException: sun.security.validator.ValidatorException: PKIX path building failed` の例外が発生することがあります。これを解決するには、次の行を `application.properties` に追加してください:

source: During the build you might find the `Caused by: javax.net.ssl.SSLHandshakeException: sun.security.validator.ValidatorException: PKIX path building failed` exception due to self-signed certificate. To solve this, add the following line to your `application.properties` file:
ja_jp: ビルド中に、自己署名証明書が原因で `Caused by: javax.net.ssl.SSLHandshakeException: sun.security.validator.ValidatorException: PKIX path building failed` 例外が発生することがあります。 これを解決するには、 `application.properties` ファイルに以下の行を追加してください：

source: During the processing of the `issue-certificate` command, the TLS registry CLI performs the following tasks:
ja_jp: `issue-certificate` コマンドの処理中に、TLS レジストリー CLI は次のタスクを実行します。

source: During the project creation, the `src/main/java/org/acme/GreetingResource.java` file has been created with the following content:
ja_jp: プロジェクト作成時には、以下の内容で `src/main/java/org/acme/getting/started/GreetingResource.java` ファイルが作成されます。

source: During the startup and readiness health check, the connector connects to the broker and retrieves the list of topics. This attribute specifies the maximum duration (in ms) for the retrieval. If exceeded, the channel is considered not-ready. Type: _long_
ja_jp: スタートアップおよび Readines チェックの間、コネクタはブローカーに接続し、トピックのリストを取得します。この属性では、検索にかける最大時間 （ms） を指定します。これを超えると、チャネルは準備ができていないとみなされます。 Type: _long_

source: During this command, TLS registry CLI reads a Let's Encrypt account information recorded during the <<lets-encrypt-issue-certificate,Issue certificates with Let's Encrypt>> step, issues a Let's Encrypt certificate request, and communicates with a Quarkus application to have ACME challenges resolved.
ja_jp: このコマンドの実行中、TLS レジストリー CLI は <<lets-encrypt-issue-certificate,Issue certificates with Let's Encrypt>> ステップで記録された Let's Encrypt アカウント情報を読み取り、Let's Encrypt 証明書リクエストを発行し、ACME チャレンジを解決するために Quarkus アプリケーションと通信します。

source: During this command, the TLS registry CLI reads the Let's Encrypt account information recorded during the <<lets-encrypt-issue-certificate,Issue certificates with Let's Encrypt>> step, issues a Let's Encrypt certificate request, and communicates with the Quarkus application to resolve ACME challenges.
ja_jp: このコマンドの実行中、TLS レジストリー CLI は <<lets-encrypt-issue-certificate,Issue certificates with Let's Encrypt>> ステップで記録された Let's Encrypt アカウント情報を読み取り、Let's Encrypt 証明書リクエストを発行し、ACME チャレンジを解決するために Quarkus アプリケーションと通信します。

source: Dynamic Config Keys in Codestart
ja_jp: Codestart の動的設定キー

source: Dynamic Credentials
ja_jp: 動的クレデンシャル

source: Dynamic Loading
ja_jp: 動的ロード

source: Dynamic address names
ja_jp: 動的アドレス名

source: Dynamic base URLs
ja_jp: 動的ベース URL

source: Dynamic clients are `@Dependent` scoped. Inject dynamic clients into components with an appropriate scope.
ja_jp: 動的クライアントは `@Dependent` スコープです。動的クライアントは適切なスコープを持つコンポーネントに注入してください。

source: Dynamic package name generation from org.acme
ja_jp: org.acmeからの動的パッケージ名生成

source: Dynamic retrieval of the Mongo Client, such as through `CDI.getBeanContainer()`, `Arc.instance()`, or an injected `Instance<ReactiveMongoClient>`, causes an exception to be thrown.
ja_jp: `CDI.getBeanContainer()`、`Arc.instance()`、または注入された `Instance<ReactiveMongoClient>` を介した Mongo クライアントの動的取得は、例外がスローされる原因となります。

source: Dynamic retrieval of the Redis Client, such as through `CDI.getBeanContainer()`, `Arc.instance()`, or an injected `Instance<ReactiveRedisDataSource>`, causes an exception to be thrown.
ja_jp: `CDI.getBeanContainer()`、 `Arc.instance()`、またはインジェクトされた `Instance<ReactiveRedisDataSource>` を介した Redis クライアントの動的な取得は、例外のスローを引き起こします。

source: Dynamic retrieval of the datasource, such as through `CDI.getBeanContainer()`, `Arc.instance()`, or an injected `Instance<DataSource>`, causes an exception to be thrown.
ja_jp: `CDI.getBeanContainer()` 、 `Arc.instance()` 、または注入された `Instance<DataSource>` などを介してデータソースを動的に取得すると、例外がスローされます。

source: Dynamic retrieval of the datasource, such as through `CDI.getBeanContainer()`, `Arc.instance()`, or by injecting an `Instance<DataSource>`, causes an exception to be thrown.
ja_jp: `CDI.getBeanContainer()` , `Arc.instance()` , または `Instance<DataSource>` を注入するなどしてデータソースを動的に取得すると、例外がスローされます。

source: Dynamic retrieval of the persistence unit, such as through `CDI.getBeanContainer()`, `Arc.instance()`, or an injected `Instance<Session>`, causes an exception to be thrown.
ja_jp: `CDI.getBeanContainer()` 、 `Arc.instance()` 、または注入された `Instance<Session>` などを通じた永続化ユニットの動的な取得は、例外がスローされる原因となります。

source: Dynamic tenant configuration resolution
ja_jp: 動的なテナント設定の解決

source: Dynamic tenant resolution using a custom `TenantConfigResolver`.
ja_jp: カスタム `TenantConfigResolver` を使用した動的なテナント解決。

source: E.g. the coordinates of the descriptor for the Quarkus BOM `io.quarkus.platform:quarkus-bom::pom:1.2.3` will be `io.quarkus.platform:quarkus-bom-quarkus-platform-descriptor:1.2.3:json:1.2.3`. And for a custom Quarkus platform defined with BOM `org.acme:acme-bom::pom:555` it will be `org.acme:acme-bom-quarkus-platform-descriptor:555:json:555`.
ja_jp: 例えば、Quarkus BOM `io.quarkus:quarkus-bom::pom:1.2.3` のディスクリプタの座標は `io.quarkus:quarkus-bom-quarkus-platform-descriptor:1.2.3:json:1.2.3` となります。また、BOM `org.acme:acme-bom::pom:555` で定義されたカスタムQuarkusプラットフォームの場合は、 `org.acme:acme-bom-quarkus-platform-descriptor:555:json:555` です。

source: E.g. the coordinates of the descriptor for the Quarkus BOM `{quarkus-platform-groupid}:quarkus-bom::pom:1.2.3` will be `{quarkus-platform-groupid}:quarkus-bom-quarkus-platform-descriptor:1.2.3:json:1.2.3`. And for a custom Quarkus platform defined with BOM `org.acme:acme-bom::pom:555` it will be `org.acme:acme-bom-quarkus-platform-descriptor:555:json:555`.
ja_jp: 例えば、Quarkus BOM `{quarkus-platform-groupid}:quarkus-bom::pom:1.2.3` の記述子の座標は `{quarkus-platform-groupid}:quarkus-bom-quarkus-platform-descriptor:1.2.3:json:1.2.3` となります。また、BOM `org.acme:acme-bom::pom:555` で定義されたカスタムQuarkusプラットフォームの場合は、 `org.acme:acme-bom-quarkus-platform-descriptor:555:json:555` となります。

source: E.g. the following sample callback:
ja_jp: 例えば、以下のようなサンプルコールバックです:

source: EXAMPLE APPLICATIONS
ja_jp: アプリケーション例

source: EZConnect Format
ja_jp: EZConnect 形式

source: EZConnect format
ja_jp: EZConnect 形式

source: Each Dev Resource implementation is an `@QuarkusTestResourceLifecycleManager` implementation as well
ja_jp: Dev Resource の実装は `@QuarkusTestResourceLifecycleManager` の実装でもあります

source: Each Dev UI page (created with CardPageBuildItem) needs a translation key for its title.
ja_jp: 各 Dev UI ページ (CardPageBuildItem で作成) には、そのタイトルに対応する翻訳キーが必要です。

source: Each Funqy Java class is a Quarkus Arc component and supports dependency injection through CDI or Spring DI. Spring DI requires including the `quarkus-spring-di` dependency in your build.
ja_jp: 各Funqy JavaクラスはQuarkus Arcコンポーネントであり、CDIまたはSpring DIによる依存性注入をサポートしています。Spring DIでは、ビルドに `quarkus-spring-di` 依存関係を含める必要があります。

source: Each IDE integration has its own configuration requirements. The Visual Studio Code IDE extension, for example, requires a definition of the Vale CLI path:
ja_jp: 各 IDE インテグレーションには独自の設定要件があります。たとえば、Visual Studio Code IDE エクステンションでは、Vale CLI パスの定義が必要です。

source: Each IDE integration has its own configuration requirements. The Visual Studio Code IDE extension, for example, requires definition of the Vale CLI path:
ja_jp: 各 IDE 統合には、独自の設定要件があります。例えば、Visual Studio CodeのIDE拡張では、Vale CLIパスの定義が必要です：

source: Each Memory region that has been allocated for the process is listed;
ja_jp: プロセスに割り当てられた各メモリ領域が一覧表示されます;

source: Each OIDC client registration configuration represents an OIDC client registration endpoint which can accept many individual client registrations.
ja_jp: 各 OIDC クライアント登録設定は、多数の個別のクライアント登録を受け入れることができる OIDC クライアント登録エンドポイントを表します。

source: Each OIDC tenant can either permit or deny storing its `quarkus.oidc.TokenIntrospection` and/or `quarkus.oidc.UserInfo` data with boolean `quarkus.oidc."tenant".allow-token-introspection-cache` and `quarkus.oidc."tenant".allow-user-info-cache` properties.
ja_jp: 各 OIDC テナントは、ブール値 `quarkus.oidc."tenant".allow-token-introspection-cache` および `quarkus.oidc."tenant".allow-user-info-cache` プロパティーを使用して、その `quarkus.oidc.TokenIntrospection` や `quarkus.oidc.UserInfo` データを保存することを許可または拒否できます。

source: Each OIDC tenant can either permit or deny the storing of its `quarkus.oidc.TokenIntrospection` data, `quarkus.oidc.UserInfo` data, or both with boolean `quarkus.oidc."tenant".allow-token-introspection-cache` and `quarkus.oidc."tenant".allow-user-info-cache` properties.
ja_jp: 各 OIDC テナントは、 `quarkus.oidc.TokenIntrospection` データ、 `quarkus.oidc.UserInfo` データ、またはその両方の保存を許可または拒否できます。これには、ブール値の `quarkus.oidc."tenant".allow-token-introspection-cache` プロパティーと `quarkus.oidc."tenant".allow-user-info-cache` プロパティーを使用します。

source: Each OIDC tenant configuration represents specific requirements associated with a single OIDC provider, an individual tenant or realm among multiple OIDC provider tenants or realms. For example, you may have one tenant for Keycloak, another tenant for Azure. Or you can have many tenants representing individual Keycloak realms or clients in a single Keycloak realm, or multiple Azure tenants.
ja_jp: 各 OIDC テナント設定は、単一の OIDC プロバイダー、または複数の OIDC プロバイダーのテナントやレルムの中の個々のテナントやレルムに関連付けられた特定の要件を表します。たとえば、Keycloak 用のテナントと Azure 用のテナントを 1 つずつ持つことができます。あるいは、単一の Keycloak レルム内の個々の Keycloak レルムやクライアント、または複数の Azure テナントを表す多くのテナントを持つこともできます。

source: Each Quarkus Platform is expected to provide a Maven BOM artifact that
ja_jp: 各Quarkusプラットフォームは、次のようなMaven BOMアーティファクトを提供することが期待されています:
